In [1]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

'Connected: None@factbook.db'

In [3]:
%%sql
SELECT *
  FROM sqlite_master
 WHERE type='table';

Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)')]

In [4]:
%%sql
SELECT *
FROM facts
LIMIT 5

Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [5]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts

Done.

[(0, 7256490011, 0.0, 4.02)]

In [6]:
%%sql
SELECT name
FROM facts
WHERE population = (SELECT MIN(population) FROM facts)

Done.

[('Antarctica',)]

In [7]:
%%sql
SELECT name
FROM facts
WHERE population = (SELECT MAX(population) FROM facts)

Done.

[('World',)]

In [8]:
%%sql
SELECT MIN(population), MAX(population), MIN(population_growth), MAX(population_growth)
FROM facts
WHERE name <> 'World'

Done.

[(0, 1367485388, 0.0, 4.02)]

In [9]:
%%sql
SELECT AVG(population), AVG(area)
FROM facts
WHERE name <> 'World'

Done.

[(32242666.56846473, 555093.546184739)]

In [11]:
%%sql
SELECT name
FROM facts
WHERE population > (SELECT AVG(population) FROM facts) AND area < (SELECT AVG(area) FROM facts)

Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

In [18]:
%%sql 
SELECT name
FROM facts 
WHERE population = (SELECT MAX(population) FROM facts WHERE name <> 'World')

Done.

[('China',)]

In [20]:
%%sql 
SELECT name
FROM facts 
WHERE population_growth = (SELECT MAX(population_growth) FROM facts WHERE name <> 'World')

Done.

[('South Sudan',)]

In [32]:
%%sql
SELECT name
FROM facts
WHERE area_water>area_land

Done.

[('British Indian Ocean Territory',), ('Virgin Islands',)]

In [34]:
%%sql
SELECT name
FROM facts
WHERE death_rate>birth_rate

Done.

[('Austria',),
 ('Belarus',),
 ('Bosnia and Herzegovina',),
 ('Bulgaria',),
 ('Croatia',),
 ('Czech Republic',),
 ('Estonia',),
 ('Germany',),
 ('Greece',),
 ('Hungary',),
 ('Italy',),
 ('Japan',),
 ('Latvia',),
 ('Lithuania',),
 ('Moldova',),
 ('Monaco',),
 ('Poland',),
 ('Portugal',),
 ('Romania',),
 ('Russia',),
 ('Serbia',),
 ('Slovenia',),
 ('Ukraine',),
 ('Saint Pierre and Miquelon',)]

In [36]:
%%sql 
SELECT name, population/area
FROM facts
ORDER BY population/area DESC
LIMIT 5

Done.

[('Macau', 21168),
 ('Monaco', 15267),
 ('Singapore', 8141),
 ('Hong Kong', 6445),
 ('Gaza Strip', 5191)]